## Tworzenie DataFrame

DataFrame można stworzyć na wiele sposobów, m.in. z listy słowników, słownika list, tablicy NumPy czy pliku CSV.

In [1]:
import pandas as pd

# Tworzenie DataFrame ze słownika list
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 24, 35, 32],
    'City': ['New York', 'Paris', 'Berlin', 'London']
}

df = pd.DataFrame(data)
df

    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [4]:
# Tworzenie DataFrame z listy słowników
data = [
    {'Name': 'John', 'Age': 30, 'City': 'New York'},
    {'Name': 'Anna', 'Age': 28, 'City': 'Paris'},
    {'Name': 'Paolo', 'Age': 35, 'City': 'Munich'},
    {'Name': 'Linda', 'Age': 32, 'City': 'Liverpool'}
]

df = pd.DataFrame(data)

df

    Name  Age       City
0   John   30   New York
1   Anna   28      Paris
2  Paolo   35     Munich
3  Linda   32  Liverpool

In [9]:
import numpy as np

# Tworzenie DataFrame z tablicy NumPy
data = np.array([
    ['John', 32, 'Los Angeles'],
    ['Luca', 24, 'Rome'],
    ['Andreas', 38, 'Berlin'],
    ['Linda', 32, 'London']
])

df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])

df

      Name Age         City
0     John  32  Los Angeles
1     Luca  24         Rome
2  Andreas  38       Berlin
3    Linda  32       London

## Atrybuty DataFrame

DataFrame posiada kilka użytecznych atrybutów, które pozwalają na uzyskanie informacji o danych:

- index - zwraca indeksy DataFrame.
- columns - zwraca kolumny DataFrame.
- values - zwraca wartości DataFrame.
- shape - zwraca wymiary DataFrame (liczba wierszy i kolumn).

In [11]:
def s():
    print("\n", "-" * 20, '\n')

print(df.index)
s()
print(df.columns)
s()
print(df.values)
s()
print(df.shape)

df.head()

RangeIndex(start=0, stop=4, step=1)

 --------------------

Index(['Name', 'Age', 'City'], dtype='object')

 --------------------

[['John' '32' 'Los Angeles']
 ['Luca' '24' 'Rome']
 ['Andreas' '38' 'Berlin']
 ['Linda' '32' 'London']]

 --------------------

(4, 3)

      Name Age         City
0     John  32  Los Angeles
1     Luca  24         Rome
2  Andreas  38       Berlin
3    Linda  32       London

## Indeksowanie i Slicing

Podobnie jak w przypadku Series, DataFrame można indeksować i wycinać na różne sposoby.

In [12]:
print(df['Name'])
s()
df[['Name', 'City']]

0       John
1       Luca
2    Andreas
3      Linda
Name: Name, dtype: object

 --------------------

      Name         City
0     John  Los Angeles
1     Luca         Rome
2  Andreas       Berlin
3    Linda       London

### Indeksowanie za pomocą numerów wierszy i kolumn (loc i iloc)

In [13]:
print(df.loc[0])

Name           John
Age              32
City    Los Angeles
Name: 0, dtype: object

In [14]:
print(df.loc[0:1, 'Name':'City'])

   Name Age         City
0  John  32  Los Angeles
1  Luca  24         Rome

In [15]:
print(df.iloc[0])

Name           John
Age              32
City    Los Angeles
Name: 0, dtype: object

In [18]:
print(df.iloc[0:3, 0:3])

      Name Age         City
0     John  32  Los Angeles
1     Luca  24         Rome
2  Andreas  38       Berlin

#### loc - Indeksowanie za pomocą etykiet

- Indeksowanie etykietami: loc pozwala na odwoływanie się do wierszy i kolumn za pomocą ich etykiet (nazw).
- Zawiera wartość końcową: Zakresy są inkluzywne - oznacza to, że zarówno początek, jak i koniec zakresu są włączone.
- Działa z indeksami oraz nazwami kolumn: Można używać zarówno wartości indeksu wiersza, jak i nazw kolumn.

#### iloc - Indeksowanie za pomocą pozycji

- Indeksowanie pozycjami: iloc pozwala na odwoływanie się do wierszy i kolumn za pomocą ich pozycji liczbowych (integer-based indexing).
- Nie zawiera wartości końcowej: Zakresy są półotwarte - oznacza to, że początek zakresu jest włączony, ale koniec zakresu jest wyłączony.
- Działa z pozycjami wierszy i kolumn: Można używać tylko pozycji liczbowych, zarówno dla wierszy, jak i kolumn.